## Exercise 4
Let's dive into the serious business now!

### Description
[Kaggle](http://www.kagle.com/) is a great platform to learn machine learning. They offer free datasets and organize competitions around them. You can even be paid if you win one of them!

Now that you know how to build a classifier, try with [the titanic dataset!](https://www.kaggle.com/c/titanic).

### Steps
1. Download the dataset.
2. Import it in a jupyter notebook.
3. Analyse the data.
4. Divide the dataset. (train data and test data)
5. Build a classifier using the algorithm of you choice and fit it with your train data.
6. Evaluate the model with your test data.
7. When you're satisfied with the result, fit your model with the complete dataset.
8. Predict the Kaggle's test set and [submit your prediciton](https://www.kaggle.com/c/titanic/overview).
9. Which score did you get?

**DISCLAIMER:** If you look at Kaggle's leaderboard, you will see a lot of people have a score of 100%. They just found the name of people that survived online. Great lesson here, when you are learning something, never compare yourself to others. All that matters is what you've learned.

In [1]:
# Add you code here...
import pandas as pd 

df_train = pd.read_csv('assets/train.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df_train.shape

(891, 12)

In [2]:
print(df_train.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
#Here i'll try to fill NaN values of age by is Mean
df_train.Age.mode()
df_train.Age = df_train.Age.fillna(float(df_train.Age.mode()))

In [6]:
print(df_train.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df_train = df_train.drop(columns=['Cabin'])

In [8]:
print(df_train.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [9]:
nan_value = float("NaN")
df_train.replace("", nan_value, inplace=True)

df_train.dropna(subset=['Embarked'],inplace=True)

In [10]:
gender_dummies = pd.get_dummies(df_train.Sex,drop_first=True)

#Before Dummies Embarked i do remove NaN
embarked_dummies = pd.get_dummies(df_train.Embarked)

In [11]:
df_train = df_train.drop(columns=['Sex','Embarked'])
df_train = pd.concat([df_train,gender_dummies,embarked_dummies],axis=1)

In [12]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,male,C,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,1,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,0,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,1,0,0,1

In [13]:
# I do remove cabin 'cause I don't see the importance of this column..also there is too much NaN.. 

df_train = df_train.drop(columns=['Ticket','Fare','Name','PassengerId','Pclass'])

In [14]:
df_train.head()

   Survived   Age  SibSp  Parch  male  C  Q  S
0         0  22.0      1      0     1  0  0  1
1         1  38.0      1      0     0  1  0  0
2         1  26.0      0      0     0  0  0  1
3         1  35.0      1      0     0  0  0  1
4         0  35.0      0      0     1  0  0  1

In [15]:
X = df_train.drop('Survived',axis=1)
y = df_train['Survived']

In [16]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 889, dtype: int64

In [17]:
X.head()

    Age  SibSp  Parch  male  C  Q  S
0  22.0      1      0     1  0  0  1
1  38.0      1      0     0  1  0  0
2  26.0      0      0     0  0  0  1
3  35.0      1      0     0  0  0  1
4  35.0      0      0     1  0  0  1

In [18]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier()

In [19]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [20]:
clf.fit(X_train,y_train)

RandomForestClassifier()

In [21]:
print(clf.predict(X_test))

[0 1 1 0 0 1 0 0 0 1 1 1 0 0 1 1 0 0 1 0 0 1 0 1 0 0 0 0 0 0 1 0 1 0 0 0 0
 0 1 0 0 1 0 1 0 0 0 0 1 0 1 0 1 0 1 0 1 1 1 1 1 1 1 1 0 0 1 0 0 0 1 1 0 1
 1 0 0 1 0 1 1 1 0 0 1 1 0 0 0 0 0 1 0 1 0 0 0 0 1 0 0 0 0 0 1 0 0 0 1 0 1
 0 1 0 0 0 1 0 0 0 1 0 1 0 1 0 1 0 1 1 1 0 1 0 1 1 0 0 0 0 1 1 0 0 0 1 0 0
 1 0 0 1 0 0 0 0 0 0 1 1 1 1 1 1 0 0 0 1 0 1 1 0 0 0 1 0 0 0 1 0 1 1 0 0 0
 0 0 1 0 0 1 1 1 1 0 0 1 0 0 1 0 1 1 1 0 0 1 1 1 1 0 0 1 0 0 0 1 0 1 1 0 1
 0 0 0 0 0 0 1 0 0 0 1 1 0 1 0 0 0 0 1 0 0 0 1 0 1 1 0 1 1 0 1 1 0 0 1 0 0
 1 0 0 1 1 0 0 0]

In [22]:
print(y_test)

616    0
264    0
736    0
202    0
850    0
      ..
532    0
842    1
718    0
281    0
430    1
Name: Survived, Length: 267, dtype: int64

In [26]:
print(clf.score(X_test, y_test))

0.7715355805243446